# ~ pandas is a tool for data processing which helps in data analysis

  # ~ it provides function and methods to efficientiy manipulate large datasets

# data structures in pandas:
    -Series(one-dimensional array)
    -DataFrame(two-dimensional array)

In [4]:
import pandas as pd

In [6]:
print(pd.__version__)   # check pandas version

1.4.2

# Series create,manipulate,querrey,delete

In [21]:
# creating a sereies from a list
l=[1,2,5,3]
s=pd.Series(l)
s

0    1
1    2
2    5
3    3
dtype: int64

In [25]:
o=[1,3,4,6]
s2=pd.Series(l, index=o)      # The o list is a index and l list ekements are index values 
s2

1    1
3    2
4    5
6    3
dtype: int64

In [32]:
import numpy as np
n=np.random.randn(5)       # create a random ndarray   five values
i=["a","b","c","d","e"]    # The strings are a indexes
s3=pd.Series(n,index=i)
s3

a   -0.734350
b   -0.054932
c   -0.158650
d    2.109112
e    0.203903
dtype: float64

In [34]:
# create a Series from dictionaries

d={"a":1,"b":2,"c":3,"d":4}                   # The keys are the indexes in dicrionaries
s4=pd.Series(d)
s4

a    1
b    2
c    3
d    4
dtype: int64

In [47]:
# if you modify the index Series

b=[1,3,4,5,7]
s5=pd.Series(b)                        # This is default Series we are use
print(s5)           
s5.index=["a","b","c","d","e"]         # change the index positions
s5

0    1
1    3
2    4
3    5
4    7
dtype: int64

a    1
b    3
c    4
d    5
e    7
dtype: int64

In [52]:
# slicing 
b=[1,3,4,5,7]
s5=pd.Series(b)                # slice the Series and values
s5[2:]

2    4
3    5
4    7
dtype: int64

In [66]:
x=[1,3,4,5,7]
s6=pd.Series(x)
print(s6)                          # print the Series and valuse
y=[0,2,6,8,9]
s7=pd.Series(y)
print(s7)                          # print the Series and value

s8=s6.append(s7)                   # here append the two list in one variable
print(s8)

0    1
1    3
2    4
3    5
4    7
dtype: int64
0    0
1    2
2    6
3    8
4    9
dtype: int64
0    1
1    3
2    4
3    5
4    7
0    0
1    2
2    6
3    8
4    9
dtype: int64

C:\Users\Administrator\AppData\Local\Temp\ipykernel_4472\2009724630.py:8: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s8=s6.append(s7)                   # here append the two list in one variable

In [81]:
x=[1,3,4,5,7]
s6=pd.Series(x)
print(s6)

0    1
1    3
2    4
3    5
4    7
dtype: int64

In [85]:
s6.drop(3)      # drop the particular Series

0    1
1    3
2    4
4    7
dtype: int64

# Series operations

In [107]:
a=[1,4,3,2,5,6]
b=[6,2,8,9,0]
s0=pd.Series(a)
s0

0    1
1    4
2    3
3    2
4    5
5    6
dtype: int64

In [108]:
s00=pd.Series(b)
s00

0    6
1    2
2    8
3    9
4    0
dtype: int64

In [109]:
s0.add(s00)                        # add s0 and s00   # The 6th Series not in s00 then the value is NaN

0     7.0
1     6.0
2    11.0
3    11.0
4     5.0
5     NaN
dtype: float64

In [110]:
s0.sub(s00)                       # subtract s0 and s00

0   -5.0
1    2.0
2   -5.0
3   -7.0
4    5.0
5    NaN
dtype: float64

In [111]:
s0.div(s00)               # divide s0 and s00

0    0.166667
1    2.000000
2    0.375000
3    0.222222
4         inf
5         NaN
dtype: float64

In [116]:
s0.mul(s00)                # Multiply s0 and  s00

0     6.0
1     8.0
2    24.0
3    18.0
4     0.0
5     NaN
dtype: float64

In [118]:
e=[1,9,3,0,5,7]
f=[6,8,5,4,2,3]
s_=pd.Series(e)
s_

0    1
1    9
2    3
3    0
4    5
5    7
dtype: int64

In [123]:
print("Median of s_ is:", s_.median())
print("Median of s_ is:", s_.max())
print("Median of s_ is:", s_.min())

Median of s_ is: 4.0
Median of s_ is: 9
Median of s_ is: 0

# Create DataFrame

In [161]:
dates=pd.date_range('today', periods=6)       # Define sequence as dates and time
dates

DatetimeIndex(['2022-09-03 19:28:42.976431', '2022-09-04 19:28:42.976431',
               '2022-09-05 19:28:42.976431', '2022-09-06 19:28:42.976431',
               '2022-09-07 19:28:42.976431', '2022-09-08 19:28:42.976431'],
              dtype='datetime64[ns]', freq='D')

In [247]:
dates=pd.date_range('today', periods=6)
n_arr=np.random.randn(6,4)               # import numpy random array
columns=["a","b","c","d"]                 # Use the table as the column name

df=pd.DataFrame(n_arr, index=dates, columns=columns)
df

                                   a         b         c         d
2022-09-03 20:29:17.215206  0.501508  0.456110 -1.235215 -0.980279
2022-09-04 20:29:17.215206  0.070013 -0.620010 -1.215743 -1.700189
2022-09-05 20:29:17.215206 -1.697117 -0.777882  0.428587 -0.039517
2022-09-06 20:29:17.215206 -1.877044  2.974364  1.479106  0.148321
2022-09-07 20:29:17.215206  0.774764 -0.662832 -0.683259  1.134264
2022-09-08 20:29:17.215206  0.041041 -0.417685  0.856934  0.877073

In [248]:
# Create DataFrame with dictionary array

data={'animal':['cat','cow','cat','dog','snake','dog','cat','dog','snake','dog'],
      'age':[23,13,14,25,24,10,14,25,24,17],
      'visits':[2,4,3,2,5,1,2,4,3,2],
      'priority':['yes','yes','no','yes','no','no','yes','yes','no','yes']}
labels=["a","b","c","d","e","f","g","h","i","j"]
dfm=pd.DataFrame(data, index=labels)
dfm

  animal  age  visits priority
a    cat   23       2      yes
b    cow   13       4      yes
c    cat   14       3       no
d    dog   25       2      yes
e  snake   24       5       no
f    dog   10       1       no
g    cat   14       2      yes
h    dog   25       4      yes
i  snake   24       3       no
j    dog   17       2      yes

In [178]:
# see the data types in array

dfm.dtypes

animal      object
age          int64
visits       int64
priority    object
dtype: object

In [185]:
dfm.head            # finding the headers

<bound method NDFrame.head of   animal  age  visits priority
a    cat   23       2      yes
b    cow   13       4      yes
c    cat   14       3       no
d    dog   25       2      yes
e  snake   24       5       no
f    dog   10       1       no
g    cat   14       2      yes
h    dog   25       4      yes
i  snake   24       3       no
j    dog   17       2      yes>

In [188]:
dfm.head(0)         # Using indeces to print the value

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [190]:
dfm.tail()                     # The tail print default last five elements

  animal  age  visits priority
f    dog   10       1       no
g    cat   14       2      yes
h    dog   25       4      yes
i  snake   24       3       no
j    dog   17       2      yes

In [191]:
dfm.tail(2)

  animal  age  visits priority
i  snake   24       3       no
j    dog   17       2      yes

In [196]:
dfm.index                     # print the indexces   not use index()

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [199]:
dfm.columns                   # print the columns    not use columns()

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [202]:
print(dfm.index)            # same as the above code    then print both index and columns
dfm.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [205]:
dfm.values                 # print the values only

array([['cat', 23, 2, 'yes'],
       ['cow', 13, 4, 'yes'],
       ['cat', 14, 3, 'no'],
       ['dog', 25, 2, 'yes'],
       ['snake', 24, 5, 'no'],
       ['dog', 10, 1, 'no'],
       ['cat', 14, 2, 'yes'],
       ['dog', 25, 4, 'yes'],
       ['snake', 24, 3, 'no'],
       ['dog', 17, 2, 'yes']], dtype=object)

In [206]:
dfm.describe()  # see statitical data of dataframe

             age     visits
count  10.000000  10.000000
mean   18.900000   2.800000
std     5.858517   1.229273
min    10.000000   1.000000
25%    14.000000   2.000000
50%    20.000000   2.500000
75%    24.000000   3.750000
max    25.000000   5.000000

In [208]:
dfm.T                      # Change rows To columns and columns To rows

            a    b    c    d      e    f    g    h      i    j
animal    cat  cow  cat  dog  snake  dog  cat  dog  snake  dog
age        23   13   14   25     24   10   14   25     24   17
visits      2    4    3    2      5    1    2    4      3    2
priority  yes  yes   no  yes     no   no  yes  yes     no  yes

In [217]:
dfm.sort_values(by='age')   # Order the age

  animal  age  visits priority
f    dog   10       1       no
b    cow   13       4      yes
c    cat   14       3       no
g    cat   14       2      yes
j    dog   17       2      yes
a    cat   23       2      yes
e  snake   24       5       no
i  snake   24       3       no
d    dog   25       2      yes
h    dog   25       4      yes

In [241]:
# slicing Normal
                                  
dfm[2:5]                                       # print three values slicing using a,b,c......

  animal  age  visits priority
a    cat   23       2      yes
b    cow   13       4      yes
c    cat   14       3       no
d    dog   25       2      yes
e  snake   24       5       no
f    dog   10       1       no
g    cat   14       2      yes
h    dog   25       4      yes
i  snake   24       3       no
j    dog   17       2      yes

In [240]:
# slicinf in DataFrame

dfm.sort_values(by='age')[2:5]              # slicing using age values

  animal  age  visits priority
c    cat   14       3       no
g    cat   14       2      yes
j    dog   17       2      yes

In [242]:
# Query DataFrame by tag
dfm[['age','visits']]                     # only print the two columns

   age  visits
a   23       2
b   13       4
c   14       3
d   25       2
e   24       5
f   10       1
g   14       2
h   25       4
i   24       3
j   17       2

In [244]:
dfm.iloc[1:3]      # Query rows 2,3

  animal  age  visits priority
b    cow   13       4      yes
c    cat   14       3       no

In [249]:
dfm2=dfm.copy()                       # copy the dfm values
dfm2

  animal  age  visits priority
a    cat   23       2      yes
b    cow   13       4      yes
c    cat   14       3       no
d    dog   25       2      yes
e  snake   24       5       no
f    dog   10       1       no
g    cat   14       2      yes
h    dog   25       4      yes
i  snake   24       3       no
j    dog   17       2      yes

In [255]:
# Modify some values


data={'animal':['cat','cow','cat','dog','snake','dog','cat','dog','snake','dog'],
      'age':[23,13,14,25,np.nan,10,14,np.nan,24,17],
      'visits':[2,4,3,2,5,1,2,4,3,2],
      'priority':['yes','yes','no','yes','no','no','yes','yes','no','yes']}
labels=["a","b","c","d","e","f","g","h","i","j"]
dfm2=pd.DataFrame(data, index=labels)
dfm2

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
e  snake   NaN       5       no
f    dog  10.0       1       no
g    cat  14.0       2      yes
h    dog   NaN       4      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

In [257]:
dfm2.isnull()                               # identify the null values

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False  False   False     False
e   False   True   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [260]:
dfm2.loc["f","age"]=1.5               # Change particular value                                
dfm2                                  # loc mean location

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
e  snake   NaN       5       no
f    dog   1.5       1       no
g    cat  14.0       2      yes
h    dog   NaN       4      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

In [261]:
dfm2[['age']].mean()

age    16.4375
dtype: float64

In [262]:
dfm2.mean()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_4472\2345778822.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dfm2.mean()

age       16.4375
visits     2.8000
dtype: float64

In [264]:
dfm2['visits'].sum()      # sum the visit values

28

In [266]:
dfm2.sum()                # sum all the values

animal      catcowcatdogsnakedogcatdogsnakedog
age                                      131.5
visits                                      28
priority            yesyesnoyesnonoyesyesnoyes
dtype: object

In [275]:
string=pd.Series(["a","bd","efg","ase","dfg","reg","ytr"])
string

0      a
1     bd
2    efg
3    ase
4    dfg
5    reg
6    ytr
dtype: object

In [276]:
string=pd.Series(["A","BD","EFG","ASE","DFG","REG","YTR"])      
string.str.lower()                                           # upper case to lower case

0      a
1     bd
2    efg
3    ase
4    dfg
5    reg
6    ytr
dtype: object

In [277]:
string=pd.Series(["a","bd","efg","ase","dfg","reg","ytr"])
string.str.upper()                                           # lower to upper case

0      A
1     BD
2    EFG
3    ASE
4    DFG
5    REG
6    YTR
dtype: object

# Operation for DataFrame missing values

In [279]:
dfm3=dfm2.copy()
dfm3

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
e  snake   NaN       5       no
f    dog   1.5       1       no
g    cat  14.0       2      yes
h    dog   NaN       4      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

In [282]:
dfm3=dfm2.copy()
dfm3.fillna(4)                      # fill the missing values

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
e  snake   4.0       5       no
f    dog   1.5       1       no
g    cat  14.0       2      yes
h    dog   4.0       4      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

In [285]:
dfm4=dfm2.copy()               # back to original values
dfm4

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
e  snake   NaN       5       no
f    dog   1.5       1       no
g    cat  14.0       2      yes
h    dog   NaN       4      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

In [286]:
dfm4=dfm2.copy()           
dfm4.dropna(how='any')                         # The null values are droped

  animal   age  visits priority
a    cat  23.0       2      yes
b    cow  13.0       4      yes
c    cat  14.0       3       no
d    dog  25.0       2      yes
f    dog   1.5       1       no
g    cat  14.0       2      yes
i  snake  24.0       3       no
j    dog  17.0       2      yes

# DataFrame file operations

In [291]:
dfm2.to_csv('animal.csv')                        # The file stored in your system

In [290]:
dfm2_animal=pd.read_csv('animal.csv')
dfm2_animal.head(3)

  Unnamed: 0 animal   age  visits priority
0          a    cat  23.0       2      yes
1          b    cow  13.0       4      yes
2          c    cat  14.0       3       no

In [294]:
dfm2.to_excel('animal.xlsx',sheet_name="Sheet1")
dfm2_animal2=pd.read_excel('animal.xlsx','Sheet1',index_col=None,na_values=['NA'])
dfm2_animal2

  Unnamed: 0 animal   age  visits priority
0          a    cat  23.0       2      yes
1          b    cow  13.0       4      yes
2          c    cat  14.0       3       no
3          d    dog  25.0       2      yes
4          e  snake   NaN       5       no
5          f    dog   1.5       1       no
6          g    cat  14.0       2      yes
7          h    dog   NaN       4      yes
8          i  snake  24.0       3       no
9          j    dog  17.0       2      yes